<details ><summary>plan for oracle-fundaztic 2025-08-13 06:13:45 (UTC)</summary>
    <details ><summary>Locking successful</summary>
  Project kokkeanshern/infrastructure#oracle-fundaztic has been locked by PR #11
</details>

<details open="true"><summary>Plan output</summary>

```terraform
Terraform will perform the following actions:

  # oci_artifacts_container_repository.fundaztic-dev will be created
  + resource "oci_artifacts_container_repository" "fundaztic-dev" {
      + billable_size_in_gbs = (known after apply)
      + compartment_id       = "ocid1.compartment.oc1..aaaaaaaawutq5bmyehb2obqa3hcvstm5gzmboh62p7ixwwhdvgz2r73kvynq"
      + created_by           = (known after apply)
      + defined_tags         = (known after apply)
      + display_name         = "fundaztic/dev"
      + freeform_tags        = (known after apply)
      + id                   = (known after apply)
      + image_count          = (known after apply)
      + is_immutable         = false
      + is_public            = false
      + layer_count          = (known after apply)
      + layers_size_in_bytes = (known after apply)
      + namespace            = (known after apply)
      + state                = (known after apply)
      + system_tags          = (known after apply)
      + time_created         = (known after apply)
      + time_last_pushed     = (known after apply)

      + readme (known after apply)
    }

  # oci_artifacts_container_repository.fundaztic-prod will be created
  + resource "oci_artifacts_container_repository" "fundaztic-prod" {
      + billable_size_in_gbs = (known after apply)
      + compartment_id       = "ocid1.compartment.oc1..aaaaaaaawutq5bmyehb2obqa3hcvstm5gzmboh62p7ixwwhdvgz2r73kvynq"
      + created_by           = (known after apply)
      + defined_tags         = (known after apply)
      + display_name         = "fundaztic/prod"
      + freeform_tags        = (known after apply)
      + id                   = (known after apply)
      + image_count          = (known after apply)
      + is_immutable         = false
      + is_public            = false
      + layer_count          = (known after apply)
      + layers_size_in_bytes = (known after apply)
      + namespace            = (known after apply)
      + state                = (known after apply)
      + system_tags          = (known after apply)
      + time_created         = (known after apply)
      + time_last_pushed     = (known after apply)

      + readme (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────
```
</details>

</details>